const searchReducer = (state = {
    chapters: {
        inequation: ['אי שוויון עם ערך מוחלט', 'אי שוויון עם ערך מוחלט - חזרה ותזכורת', 'אי שוויון עם ערך מוחלט', 'אי שיוויון עם רב איבר בערך מוחלט'],
        wordProblems: ['בעיות מילוליות', 'בעיות מילוליות - רקע', 'תרגול נעלמים ושליפת נתונים', 'הצבת משוואות ופתרון בעיות מילוליות'],
        induction: ['אינדוקציה מתמטית', 'אינדוקציה מתמטית - רקע', 'אינדוקציה של סדרות', 'אינדוקציה עם הוספת מספר איברים', 'אינדוקציה עם איבר ראשון משתנה',
            'אינדוקציה של איברים זוגיים או אי זוגיים', 'אינדוקציה של התלכדות סדרות', 'אינדוקציה של אי שוויון', 'אינדוקציה של תכונות התחלקות'],
        calculus: ['חשבון דיפרנציאלי ואינטגרלי', 'חשבון דיפרנציאלי - רקע', 'פונקציות-חזרה', 'חשבון דיפרנציאלי', 'על סימטריה ומתמטיקה', 'שיפוע של עקום',
            'מקסימום ומינימום מקומי ומוחלט', 'חקירת פונקציה ושרטוט', 'רציפות של פונקציה', 'נגזרת שנייה', 'נקודות אי רציפות ואסימפטוטות',
            'ניתוח אסימפטוטות אופקיות', 'חקירת פונקציה עם פרמטרים', 'מציאת משיקים לפונקציה', 'הנורמל', 'משיק לפונקציה דרך נקודה מחוץ לפונקציה',
            'בעיות מקסימום ומינימום', 'נגזרת של פונקציה סתומה', 'חשבון אינטגרלי', 'מציאת פונקציה קדימה', 'שימוש באינטגרל למציאת שטחים', 'נפח גוף סיבוב',
            'תרגול כללי'],
        trig: ['טריגונומטריה', 'טריגונומטריה - רקע', 'הרדיאן', 'פונקציות טריגונומטריות', 'הגדרות, זהויות ומשוואות', 'חקירת הפונקציה הטריגונומטרית',
            'משיק ונורמל', 'מקסימום ומינימום מקומי מוחלט', 'נגזרת של פונקציה סתומה', 'אינטגרל של פונקציה טריגונומטרית',
            'טריגונומטריה של מצולעים ושל גופים מרחביים', 'משפט הסינוסים', 'משפט הקוסינוסים', 'טריגונומטריה במרחב', 'בעיות ערך קיצון בטריגונומטריה']
    },
    foundMatch: false,
    chaptersFound: []
}, action) => {
    switch (action.type) {
        case "CHAPTERS_ARR":
            state = {
                ...state,
                chaptersFound: action.payload
            };
            break;
        case "CHARS_FOUND":
            state = {
                ...state,
                foundMatch: action.payload
            };
            break;
    }
    return state;
}

export default searchReducer;